README.org
#+title: Emacs Configuration README
#+author: FR Lyvers
#+date: 2022-08-28

This repository contains my configuration for emacs. My approach for managing the configuration has continued to evolve. In the latest incarnation, it is just one large ~init.el~ file.

I am using the default package manager in emacs. I may need to change this decision at some point.

To use this repository, apply something like the following

#+begin_src shell
cd ~
git clone https://github.com/verslyfr/.emacs.d.git .emacs.d
cd .emacs.d
git clone https://github.com/fniessen/org-macros
#+end_src

* WSL - Launch html file into a browser

Will convert a file path from wsl to windows format, prepends file://, and launches it with explorer.exe. This will cause the default browser to open the file. 

#+begin_src bash :tangle "~/.local/bin/startwin.sh" :tangle-mode (identity #o544) :mkdirp yes :comments both :shebang "#!/bin/env bash"

#!/bin/env bash

filepath="$1";
[ "" == "$1" ] && filepath=".";
if [ ! -e "${filepath}" ]; then
    echo "  Did not find the file, \"$filepath\". Unable to continue.";
    return;
fi;
fullfilepath="$(realpath "${filepath}")"
winfilepath="$(wslpath -m "$fullfilepath")"
echo "  Opening \"${fullfilepath}\" using explorer.exe.";
echo "  Opening \"${winfilepath}\""
explorer.exe "file://${winfilepath}"
#+end_src

